balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ192GA110.PIC
        <edc:SFRDef edc:access="--nn---nnnnnnnnn" edc:cname="ODCF" edc:desc="" edc:impl="0x31ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--00---000000000" edc:name="ODCF" edc:nzwidth="0x10" edc:por="--00---000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ODF0" edc:desc="" edc:mask="0x1" edc:name="ODF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODF1" edc:desc="" edc:mask="0x1" edc:name="ODF1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODF2" edc:desc="" edc:mask="0x1" edc:name="ODF2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODF3" edc:desc="" edc:mask="0x1" edc:name="ODF3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODF4" edc:desc="" edc:mask="0x1" edc:name="ODF4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODF5" edc:desc="" edc:mask="0x1" edc:name="ODF5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODF6" edc:desc="" edc:mask="0x1" edc:name="ODF6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODF7" edc:desc="" edc:mask="0x1" edc:name="ODF7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODF8" edc:desc="" edc:mask="0x1" edc:name="ODF8" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="ODF12" edc:desc="" edc:mask="0x1" edc:name="ODF12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODF13" edc:desc="" edc:mask="0x1" edc:name="ODF13" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="ODF" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="ODF" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn--nnnn--nnnn" edc:cname="TRISG" edc:desc="" edc:impl="0xf3cf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="1111--1111--1111" edc:name="TRISG" edc:nzwidth="0x10" edc:por="1111--1111--1111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TRISG0" edc:desc="" edc:mask="0x1" edc:name="TRISG0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISG1" edc:desc="" edc:mask="0x1" edc:name="TRISG1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISG2" edc:desc="" edc:mask="0x1" edc:name="TRISG2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISG3" edc:desc="" edc:mask="0x1" edc:name="TRISG3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="TRISG6" edc:desc="" edc:mask="0x1" edc:name="TRISG6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISG7" edc:desc="" edc:mask="0x1" edc:name="TRISG7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISG8" edc:desc="" edc:mask="0x1" edc:name="TRISG8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISG9" edc:desc="" edc:mask="0x1" edc:name="TRISG9" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="TRISG12" edc:desc="" edc:mask="0x1" edc:name="TRISG12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISG13" edc:desc="" edc:mask="0x1" edc:name="TRISG13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISG14" edc:desc="" edc:mask="0x1" edc:name="TRISG14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISG15" edc:desc="" edc:mask="0x1" edc:name="TRISG15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="TRISG" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="TRISG" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn--nnnn--nnnn" edc:cname="PORTG" edc:desc="" edc:impl="0xf3cf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuu--uuuu--uuuu" edc:name="PORTG" edc:nzwidth="0x10" edc:por="xxxx--xxxx--xxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RG0" edc:desc="" edc:mask="0x1" edc:name="RG0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RG1" edc:desc="" edc:mask="0x1" edc:name="RG1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RG2" edc:desc="" edc:mask="0x1" edc:name="RG2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RG3" edc:desc="" edc:mask="0x1" edc:name="RG3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RG6" edc:desc="" edc:mask="0x1" edc:name="RG6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RG7" edc:desc="" edc:mask="0x1" edc:name="RG7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RG8" edc:desc="" edc:mask="0x1" edc:name="RG8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RG9" edc:desc="" edc:mask="0x1" edc:name="RG9" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RG12" edc:desc="" edc:mask="0x1" edc:name="RG12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RG13" edc:desc="" edc:mask="0x1" edc:name="RG13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RG14" edc:desc="" edc:mask="0x1" edc:name="RG14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RG15" edc:desc="" edc:mask="0x1" edc:name="RG15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="RG" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="RG" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn--nnnn--nnnn" edc:cname="LATG" edc:desc="" edc:impl="0xf3cf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuu--uuuu--uuuu" edc:name="LATG" edc:nzwidth="0x10" edc:por="0000--0000--0000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LATG0" edc:desc="" edc:mask="0x1" edc:name="LATG0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATG1" edc:desc="" edc:mask="0x1" edc:name="LATG1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATG2" edc:desc="" edc:mask="0x1" edc:name="LATG2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATG3" edc:desc="" edc:mask="0x1" edc:name="LATG3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="LATG6" edc:desc="" edc:mask="0x1" edc:name="LATG6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATG7" edc:desc="" edc:mask="0x1" edc:name="LATG7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATG8" edc:desc="" edc:mask="0x1" edc:name="LATG8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATG9" edc:desc="" edc:mask="0x1" edc:name="LATG9" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="LATG12" edc:desc="" edc:mask="0x1" edc:name="LATG12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATG13" edc:desc="" edc:mask="0x1" edc:name="LATG13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATG14" edc:desc="" edc:mask="0x1" edc:name="LATG14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATG15" edc:desc="" edc:mask="0x1" edc:name="LATG15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="LATG" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="LATG" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn--nnnn--nnnn" edc:cname="ODCG" edc:desc="" edc:impl="0xf3cf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000--0000--0000" edc:name="ODCG" edc:nzwidth="0x10" edc:por="0000--0000--0000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ODG0" edc:desc="" edc:mask="0x1" edc:name="ODG0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODG1" edc:desc="" edc:mask="0x1" edc:name="ODG1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODG2" edc:desc="" edc:mask="0x1" edc:name="ODG2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODG3" edc:desc="" edc:mask="0x1" edc:name="ODG3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="ODG6" edc:desc="" edc:mask="0x1" edc:name="ODG6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODG7" edc:desc="" edc:mask="0x1" edc:name="ODG7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODG8" edc:desc="" edc:mask="0x1" edc:name="ODG8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODG9" edc:desc="" edc:mask="0x1" edc:name="ODG9" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="ODG12" edc:desc="" edc:mask="0x1" edc:name="ODG12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODG13" edc:desc="" edc:mask="0x1" edc:name="ODG13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODG14" edc:desc="" edc:mask="0x1" edc:name="ODG14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODG15" edc:desc="" edc:mask="0x1" edc:name="ODG15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="ODG" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="ODG" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:SFRDef edc:access="--------------nn" edc:cname="PADCFG1" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00" edc:name="PADCFG1" edc:nzwidth="16" edc:por="--------------00">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PMPTTL" edc:desc="" edc:mask="0x1" edc:name="PMPTTL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RTSECSEL" edc:desc="" edc:mask="0x1" edc:name="RTSECSEL" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RTSECSEL0" edc:desc="" edc:mask="0x1" edc:name="RTSECSEL0" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:SFRDef edc:access="rrrrrrrrrrrrrrrr" edc:cname="ADC1BUF0" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx" edc:name="ADC1BUF0" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADC1BUF0" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="ADC1BUF0" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="r" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrrrrrrrrrr" edc:cname="ADC1BUF1" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx" edc:name="ADC1BUF1" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADC1BUF1" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="ADC1BUF1" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="r" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrrrrrrrrrr" edc:cname="ADC1BUF2" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx" edc:name="ADC1BUF2" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADC1BUF2" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="ADC1BUF2" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="r" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrrrrrrrrrr" edc:cname="ADC1BUF3" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx" edc:name="ADC1BUF3" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADC1BUF3" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="ADC1BUF3" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="r" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrrrrrrrrrr" edc:cname="ADC1BUF4" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx" edc:name="ADC1BUF4" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADC1BUF4" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="ADC1BUF4" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="r" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrrrrrrrrrr" edc:cname="ADC1BUF5" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx" edc:name="ADC1BUF5" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADC1BUF5" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="ADC1BUF5" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="r" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrrrrrrrrrr" edc:cname="ADC1BUF6" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx" edc:name="ADC1BUF6" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADC1BUF6" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="ADC1BUF6" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="r" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
