balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ192GA110.PIC
        <edc:SFRDef edc:access="--nnnnnn--nnnnnn" edc:cname="RPINR10" edc:desc="" edc:impl="0x3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--111111--111111" edc:name="RPINR10" edc:nzwidth="0x10" edc:por="--111111--111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IC7R" edc:desc="" edc:mask="0x3f" edc:name="IC7R" edc:nzwidth="0x6"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="IC8R" edc:desc="" edc:mask="0x3f" edc:name="IC8R" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="IC7R0" edc:desc="" edc:mask="0x1" edc:name="IC7R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC7R1" edc:desc="" edc:mask="0x1" edc:name="IC7R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC7R2" edc:desc="" edc:mask="0x1" edc:name="IC7R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC7R3" edc:desc="" edc:mask="0x1" edc:name="IC7R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC7R4" edc:desc="" edc:mask="0x1" edc:name="IC7R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC7R5" edc:desc="" edc:mask="0x1" edc:name="IC7R5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="IC8R0" edc:desc="" edc:mask="0x1" edc:name="IC8R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC8R1" edc:desc="" edc:mask="0x1" edc:name="IC8R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC8R2" edc:desc="" edc:mask="0x1" edc:name="IC8R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC8R3" edc:desc="" edc:mask="0x1" edc:name="IC8R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC8R4" edc:desc="" edc:mask="0x1" edc:name="IC8R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC8R5" edc:desc="" edc:mask="0x1" edc:name="IC8R5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn--nnnnnn" edc:cname="RPINR11" edc:desc="" edc:impl="0x3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--111111--111111" edc:name="RPINR11" edc:nzwidth="0x10" edc:por="--111111--111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OCFAR" edc:desc="" edc:mask="0x3f" edc:name="OCFAR" edc:nzwidth="0x6"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="OCFBR" edc:desc="" edc:mask="0x3f" edc:name="OCFBR" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="OCFAR0" edc:desc="" edc:mask="0x1" edc:name="OCFAR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OCFAR1" edc:desc="" edc:mask="0x1" edc:name="OCFAR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OCFAR2" edc:desc="" edc:mask="0x1" edc:name="OCFAR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OCFAR3" edc:desc="" edc:mask="0x1" edc:name="OCFAR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OCFAR4" edc:desc="" edc:mask="0x1" edc:name="OCFAR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OCFAR5" edc:desc="" edc:mask="0x1" edc:name="OCFAR5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="OCFBR0" edc:desc="" edc:mask="0x1" edc:name="OCFBR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OCFBR1" edc:desc="" edc:mask="0x1" edc:name="OCFBR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OCFBR2" edc:desc="" edc:mask="0x1" edc:name="OCFBR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OCFBR3" edc:desc="" edc:mask="0x1" edc:name="OCFBR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OCFBR4" edc:desc="" edc:mask="0x1" edc:name="OCFBR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OCFBR5" edc:desc="" edc:mask="0x1" edc:name="OCFBR5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="6"/>
        <edc:SFRDef edc:access="--nnnnnn--------" edc:cname="RPINR15" edc:desc="" edc:impl="0x3f00" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--111111--------" edc:name="RPINR15" edc:nzwidth="0x10" edc:por="--111111--------">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="IC9R" edc:desc="" edc:mask="0x3f" edc:name="IC9R" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="IC9R0" edc:desc="" edc:mask="0x1" edc:name="IC9R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC9R1" edc:desc="" edc:mask="0x1" edc:name="IC9R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC9R2" edc:desc="" edc:mask="0x1" edc:name="IC9R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC9R3" edc:desc="" edc:mask="0x1" edc:name="IC9R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC9R4" edc:desc="" edc:mask="0x1" edc:name="IC9R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC9R5" edc:desc="" edc:mask="0x1" edc:name="IC9R5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:SFRDef edc:access="--nnnnnn--------" edc:cname="RPINR17" edc:desc="" edc:impl="0x3f00" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--111111--------" edc:name="RPINR17" edc:nzwidth="0x10" edc:por="--111111--------">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="U3RXR" edc:desc="" edc:mask="0x3f" edc:name="U3RXR" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="U3RXR0" edc:desc="" edc:mask="0x1" edc:name="U3RXR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U3RXR1" edc:desc="" edc:mask="0x1" edc:name="U3RXR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U3RXR2" edc:desc="" edc:mask="0x1" edc:name="U3RXR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U3RXR3" edc:desc="" edc:mask="0x1" edc:name="U3RXR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U3RXR4" edc:desc="" edc:mask="0x1" edc:name="U3RXR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U3RXR5" edc:desc="" edc:mask="0x1" edc:name="U3RXR5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
